<!-- dflook/terraform-github-actions {"workspace":"default","backend":"7cd7f07e9c69d6f67b784cf27527bf2c7fb718fc8ee5e5f4154a153e8ffe9b9c","backend_type":"s3","plan_job_ref":"Job Terraform plan #10 at https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/7811765914","plan_hash":"6574602779aeef7ccce9dd1017b47281a4460c2c21d144506ebd23c6517652b9","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.kraken_dca_lambda_event_rule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "kraken_dca_lambda_event_rule" {
      ~ description         = "Buy BTC every day at 08:00 UTC" -> "Buy BTC every day at 08:30 UTC"
        id                  = "kraken_dca_lambda_event_rule"
        name                = "kraken_dca_lambda_event_rule"
      ~ schedule_expression = "cron(0 8 * * ? *)" -> "cron(30 8 * * ? *)"
        tags                = {}
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.kraken-dca-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-dca-lambda" {
        id                             = "kraken-dca-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:97",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.kraken-withdraw-lambda will be updated in-place
  ~ resource "aws_lambda_function" "kraken-withdraw-lambda" {
        id                             = "kraken-withdraw-lambda"
      ~ layers                         = [
          - "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:97",
        ] -> (known after apply)
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.kraken_dca_dependencies must be replaced
-/+ resource "aws_lambda_layer_version" "kraken_dca_dependencies" {
      ~ arn                         = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies:97" -> (known after apply)
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [] -> null
      ~ created_date                = "2024-02-06T20:45:36.287+0000" -> (known after apply)
      ~ id                          = "**********************************************************************" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-west-2:194627472784:layer:kraken_dca_dependencies" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "2ezoJ8GxOhW9e0mnVSuMlTncs/iRgCTeVgfG8o/fVk8=" -> "fEF37YtVE15Dz+5YPsCuKm0mBwH7/3RbF2i1KoCauw0=" # forces replacement
      ~ source_code_size            = 12337358 -> (known after apply)
      ~ version                     = "97" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #10](https://github.com/Thomas-mcinally/Kraken-DCA/actions/runs/7811765914)